## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

### Создаем базу «On-line тестирование»

В MySQL создаем схему test (удаляем все таблицы):
```mysql
DROP SCHEMA IF EXISTS test;
CREATE DATABASE test;
USE test;
```

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/test")

Engine(mysql://root:***@localhost/test)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/test

### Структура и наполнение таблиц

In [11]:
%%sql
CREATE TABLE subject (
    subject_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_subject varchar(30)
);

INSERT INTO subject (subject_id, name_subject)
VALUES 
    (1, 'Основы SQL'),
    (2, 'Основы баз данных'),
    (3, 'Физика');

SELECT * FROM subject;

 * mysql://root:***@localhost/test
0 rows affected.
3 rows affected.
3 rows affected.

[(1, 'Основы SQL'), (2, 'Основы баз данных'), (3, 'Физика')]

In [12]:
%%sql
CREATE TABLE student (
    student_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_student varchar(50)
);

INSERT INTO student (student_id, name_student)
VALUES
    (1, 'Баранов Павел'),
    (2, 'Абрамова Катя'),
    (3, 'Семенов Иван'),
    (4, 'Яковлева Галина');

SELECT * FROM student;

 * mysql://root:***@localhost/test
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Баранов Павел'),
 (2, 'Абрамова Катя'),
 (3, 'Семенов Иван'),
 (4, 'Яковлева Галина')]

In [15]:
%%sql
CREATE TABLE attempt (
    attempt_id   INT PRIMARY KEY AUTO_INCREMENT,
    student_id   INT,
    subject_id   INT,
    date_attempt date,
    result       INT,
    FOREIGN KEY (student_id) REFERENCES student (student_id) ON DELETE CASCADE,
    FOREIGN KEY (subject_id) REFERENCES subject (subject_id) ON DELETE CASCADE
);

INSERT INTO attempt (attempt_id, student_id, subject_id, date_attempt, result)
VALUES
    (1, 1, 2, '2020-03-23', 67),
    (2, 3, 1, '2020-03-23', 100),
    (3, 4, 2, '2020-03-26', 0),
    (4, 1, 1, '2020-04-15', 33),
    (5, 3, 1, '2020-04-15', 67),
    (6, 4, 2, '2020-04-21', 100),
    (7, 3, 1, '2020-05-17', 33);

SELECT * FROM attempt;

 * mysql://root:***@localhost/test
0 rows affected.
7 rows affected.
7 rows affected.

[(1, 1, 2, datetime.date(2020, 3, 23), 67),
 (2, 3, 1, datetime.date(2020, 3, 23), 100),
 (3, 4, 2, datetime.date(2020, 3, 26), 0),
 (4, 1, 1, datetime.date(2020, 4, 15), 33),
 (5, 3, 1, datetime.date(2020, 4, 15), 67),
 (6, 4, 2, datetime.date(2020, 4, 21), 100),
 (7, 3, 1, datetime.date(2020, 5, 17), 33)]

In [16]:
%%sql
CREATE TABLE question (
    question_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_question varchar(100), 
    subject_id    INT,
    FOREIGN KEY (subject_id) REFERENCES subject (subject_id) ON DELETE CASCADE
);

INSERT INTO question (question_id, name_question, subject_id)
VALUES
    (1, 'Запрос на выборку начинается с ключевого слова:', 1),
    (2, 'Условие, по которому отбираются записи, задается после ключевого слова:', 1),
    (3, 'Для сортировки используется:', 1),
    (4, 'Какой запрос выбирает все записи из таблицы student:', 1),
    (5, 'Для внутреннего соединения таблиц используется оператор:', 1),
    (6, 'База данных - это:', 2),
    (7, 'Отношение - это:', 2),
    (8, 'Концептуальная модель используется для', 2),
    (9, 'Какой тип данных не допустим в реляционной таблице?', 2);

SELECT * FROM question;

 * mysql://root:***@localhost/test
0 rows affected.
9 rows affected.
9 rows affected.

[(1, 'Запрос на выборку начинается с ключевого слова:', 1),
 (2, 'Условие, по которому отбираются записи, задается после ключевого слова:', 1),
 (3, 'Для сортировки используется:', 1),
 (4, 'Какой запрос выбирает все записи из таблицы student:', 1),
 (5, 'Для внутреннего соединения таблиц используется оператор:', 1),
 (6, 'База данных - это:', 2),
 (7, 'Отношение - это:', 2),
 (8, 'Концептуальная модель используется для', 2),
 (9, 'Какой тип данных не допустим в реляционной таблице?', 2)]

In [17]:
%%sql
CREATE TABLE answer (
    answer_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_answer varchar(100),
    question_id INT,
    is_correct  BOOLEAN,
    CONSTRAINT answer_ibfk_1 FOREIGN KEY (question_id) REFERENCES question (question_id) ON DELETE CASCADE
);

INSERT INTO answer (answer_id, name_answer, question_id, is_correct)
VALUES
    (1, 'UPDATE', 1, FALSE),
    (2, 'SELECT', 1, TRUE),
    (3, 'INSERT', 1, FALSE),
    (4, 'GROUP BY', 2, FALSE),
    (5, 'FROM', 2 ,FALSE),
    (6, 'WHERE', 2, TRUE),
    (7, 'SELECT', 2, FALSE),
    (8, 'SORT', 3, FALSE),
    (9, 'ORDER BY', 3, TRUE),
    (10, 'RANG BY', 3, FALSE),
    (11, 'SELECT * FROM student', 4, TRUE),
    (12, 'SELECT student', 4, FALSE),
    (13, 'INNER JOIN', 5, TRUE),
    (14, 'LEFT JOIN', 5, FALSE),
    (15, 'RIGHT JOIN', 5, FALSE),
    (16, 'CROSS JOIN', 5, FALSE),
    (17, 'совокупность данных, организованных по определенным правилам', 6, TRUE),
    (18, 'совокупность программ для хранения и обработки больших массивов информации', 6, FALSE),
    (19, 'строка', 7, FALSE),
    (20, 'столбец', 7, FALSE),
    (21, 'таблица', 7, TRUE),
    (22, 'обобщенное представление пользователей о данных', 8, TRUE),
    (23, 'описание представления данных в памяти компьютера', 8, FALSE),
    (24, 'база данных', 8, FALSE),
    (25, 'file', 9, TRUE),
    (26, 'INT', 9, FALSE),
    (27, 'VARCHAR', 9, FALSE),
    (28, 'DATE', 9, FALSE);

SELECT * FROM answer;

 * mysql://root:***@localhost/test
0 rows affected.
28 rows affected.
28 rows affected.

[(1, 'UPDATE', 1, 0),
 (2, 'SELECT', 1, 1),
 (3, 'INSERT', 1, 0),
 (4, 'GROUP BY', 2, 0),
 (5, 'FROM', 2, 0),
 (6, 'WHERE', 2, 1),
 (7, 'SELECT', 2, 0),
 (8, 'SORT', 3, 0),
 (9, 'ORDER BY', 3, 1),
 (10, 'RANG BY', 3, 0),
 (11, 'SELECT * FROM student', 4, 1),
 (12, 'SELECT student', 4, 0),
 (13, 'INNER JOIN', 5, 1),
 (14, 'LEFT JOIN', 5, 0),
 (15, 'RIGHT JOIN', 5, 0),
 (16, 'CROSS JOIN', 5, 0),
 (17, 'совокупность данных, организованных по определенным правилам', 6, 1),
 (18, 'совокупность программ для хранения и обработки больших массивов информации', 6, 0),
 (19, 'строка', 7, 0),
 (20, 'столбец', 7, 0),
 (21, 'таблица', 7, 1),
 (22, 'обобщенное представление пользователей о данных', 8, 1),
 (23, 'описание представления данных в памяти компьютера', 8, 0),
 (24, 'база данных', 8, 0),
 (25, 'file', 9, 1),
 (26, 'INT', 9, 0),
 (27, 'VARCHAR', 9, 0),
 (28, 'DATE', 9, 0)]

In [18]:
%%sql
CREATE TABLE testing (
    testing_id  INT PRIMARY KEY AUTO_INCREMENT,
    attempt_id  INT,
    question_id INT,
    answer_id   INT,
    FOREIGN KEY (attempt_id) REFERENCES attempt (attempt_id) ON DELETE CASCADE
);

INSERT INTO testing (testing_id, attempt_id, question_id, answer_id)
VALUES
    (1, 1, 9, 25),
    (2, 1, 7, 19),
    (3, 1, 6, 17),
    (4, 2, 3, 9),
    (5, 2, 1, 2),
    (6, 2, 4, 11),
    (7, 3, 6, 18),
    (8, 3, 8, 24),
    (9, 3, 9, 28),
    (10, 4, 1, 2),
    (11, 4, 5, 16),
    (12, 4, 3, 10),
    (13, 5, 2, 6),
    (14, 5, 1, 2),
    (15, 5, 4, 12),
    (16, 6, 6, 17),
    (17, 6, 8, 22),
    (18, 6, 7, 21),
    (19, 7, 1, 3),
    (20, 7, 4, 11),
    (21, 7, 5, 16);

SELECT * FROM testing;

 * mysql://root:***@localhost/test
0 rows affected.
21 rows affected.
21 rows affected.

[(1, 1, 9, 25),
 (2, 1, 7, 19),
 (3, 1, 6, 17),
 (4, 2, 3, 9),
 (5, 2, 1, 2),
 (6, 2, 4, 11),
 (7, 3, 6, 18),
 (8, 3, 8, 24),
 (9, 3, 9, 28),
 (10, 4, 1, 2),
 (11, 4, 5, 16),
 (12, 4, 3, 10),
 (13, 5, 2, 6),
 (14, 5, 1, 2),
 (15, 5, 4, 12),
 (16, 6, 6, 17),
 (17, 6, 8, 22),
 (18, 6, 7, 21),
 (19, 7, 1, 3),
 (20, 7, 4, 11),
 (21, 7, 5, 16)]

## 3.1.2 Задание

Вывести студентов, которые сдавали дисциплину «Основы баз данных», указать дату попытки и результат. Информацию вывести по убыванию результатов тестирования.

In [5]:
%%sql
SELECT
    name_student,
    date_attempt,
    result
FROM
    subject
    JOIN attempt USING(subject_id)
    JOIN student USING(student_id)
WHERE
    name_subject = 'Основы баз данных'
ORDER BY
    result DESC;

 * mysql://root:***@localhost/test
3 rows affected.

[('Яковлева Галина', datetime.date(2020, 4, 21), 100),
 ('Баранов Павел', datetime.date(2020, 3, 23), 67),
 ('Яковлева Галина', datetime.date(2020, 3, 26), 0)]

## 3.1.3 Задание

Вывести, сколько попыток сделали студенты по каждой дисциплине, а также средний результат попыток, который округлить до 2 знаков после запятой. Под результатом попытки понимается процент правильных ответов на вопросы теста, который занесен в столбец **result**. В результат включить название дисциплины, а также вычисляемые столбцы **Количество** и **Среднее**. Информацию вывести по убыванию средних результатов.
**Пояснение**: Чтобы вывести дисциплину, тестирование по которой никто не проходил, использовать оператор внешнего соединения.

In [6]:
%%sql
SELECT
    name_subject,
    count(result) AS Количество,
    ROUND(AVG(result), 2) AS Среднее
FROM
    subject s LEFT JOIN attempt a
    ON s.subject_id = a.subject_id
GROUP BY
    name_subject
ORDER BY
    Среднее DESC;

 * mysql://root:***@localhost/test
3 rows affected.

[('Основы SQL', 4, Decimal('58.25')),
 ('Основы баз данных', 3, Decimal('55.67')),
 ('Физика', 0, None)]

## 3.1.4 Задание

Вывести студентов (различных студентов), имеющих максимальные результаты попыток. Информацию отсортировать в алфавитном порядке по фамилии студента.
Максимальный результат не обязательно будет 100%, поэтому явно это значение в запросе не задавать.
Для получения максимального результата используйте вложенный запрос.

In [7]:
%%sql
SELECT
    name_student,
    result
FROM
    student
    JOIN attempt USING(student_id)
WHERE
    result = (
        SELECT MAX(result)
        FROM attempt)
ORDER BY
    name_student ASC;

 * mysql://root:***@localhost/test
2 rows affected.

[('Семенов Иван', 100), ('Яковлева Галина', 100)]

## 3.1.5 Задание

Если студент совершал **несколько попыток** по одной и той же дисциплине, то вывести разницу в днях между первой и последней попыткой. В результат включить фамилию и имя студента, название дисциплины и вычисляемый столбец **Интервал**. Информацию вывести по возрастанию разницы. Студентов, сделавших одну попытку по дисциплине, не учитывать. 
Дату первой и последней попытки получить как минимальное и максимальное значение даты с помощью *групповых функций*, для вычисления разницы между датами использовать функцию *DATEDIFF()*.

In [8]:
%%sql
SELECT
    name_student,
    name_subject,
    DATEDIFF(MAX(date_attempt), MIN(date_attempt)) AS Интервал
FROM
    subject
    JOIN attempt USING(subject_id)
    JOIN student USING(student_id)
GROUP BY
    name_student,
    name_subject
HAVING
    COUNT(date_attempt) > 1
ORDER BY
    Интервал;

 * mysql://root:***@localhost/test
2 rows affected.

[('Яковлева Галина', 'Основы баз данных', 26),
 ('Семенов Иван', 'Основы SQL', 55)]

## 3.1.6 Задание

Студенты могут тестироваться по одной или нескольким дисциплинам (не обязательно по всем). Вывести дисциплину и количество уникальных студентов (столбец назвать **Количество**), которые по ней проходили тестирование . Информацию отсортировать сначала по убыванию количества, а потом по названию дисциплины. В результат включить и дисциплины, тестирование по которым студенты еще не проходили, в этом случае указать количество студентов 0.  
**Пояснение**: Если один и тот же студент тестировался несколько раз по одной и той же дисциплине, то студента учитывать один раз. Чтобы вывести дисциплину, по которой никто не проходил тестирование, используйте внешнее соединение таблиц.

In [9]:
%%sql
SELECT
    name_subject,
    COUNT(DISTINCT student_id) AS Количество
FROM
    subject
    LEFT JOIN attempt USING(subject_id)
GROUP BY
    name_subject
ORDER BY
    Количество DESC,
    name_subject ASC;

 * mysql://root:***@localhost/test
3 rows affected.

[('Основы SQL', 2), ('Основы баз данных', 2), ('Физика', 0)]

## 3.1.7 Задание

Случайным образом отберите 3 вопроса по дисциплине «Основы баз данных». В результат включите столбцы **question_id** и **name_question**.  
**Пояснение**: Для выбора случайных вопросов можно отсортировать вопросы в случайном порядке: ORDER BY RAND()

In [10]:
%%sql
SELECT
    question_id,
    name_question 
FROM
    subject
    JOIN question USING(subject_id)
WHERE
    name_subject = 'Основы баз данных'
ORDER BY
    RAND()
LIMIT 3;

 * mysql://root:***@localhost/test
3 rows affected.

[(7, 'Отношение - это:'),
 (9, 'Какой тип данных не допустим в реляционной таблице?'),
 (6, 'База данных - это:')]

## 3.1.8 Задание

Вывести вопросы, которые были включены в тест для Семенова Ивана по дисциплине «Основы SQL» 2020-05-17 (значение **attempt_id** для этой попытки равно 7). Указать, какой ответ дал студент и правильный он или нет (вывести **Верно** или **Неверно**). В результат включить вопрос, ответ и вычисляемый столбец **Результат**.

In [11]:
%%sql
SELECT
    name_question,
    name_answer,
    IF(is_correct = 1, 'Верно', 'Неверно') AS Результат
FROM
    answer
    JOIN testing USING(answer_id)
    JOIN question 
    ON testing.question_id = question.question_id
WHERE
     testing.attempt_id = 7;

 * mysql://root:***@localhost/test
3 rows affected.

[('Запрос на выборку начинается с ключевого слова:', 'INSERT', 'Неверно'),
 ('Какой запрос выбирает все записи из таблицы student:', 'SELECT * FROM student', 'Верно'),
 ('Для внутреннего соединения таблиц используется оператор:', 'CROSS JOIN', 'Неверно')]

## 3.1.9 Задание

Посчитать результаты тестирования. Результат попытки вычислить как количество правильных ответов, деленное на 3 (количество вопросов в каждой попытке) и умноженное на 100. Результат округлить до двух знаков после запятой. Вывести фамилию студента, название предмета, дату и результат. Последний столбец назвать **Результат**. Информацию отсортировать сначала по фамилии студента, потом по убыванию даты попытки.  
**Пояснение**: В запрос не рекомендуется включать таблицу **question**, нужно связать answer непосредственно с **testing**. Если же в этом запросе использовать связь **testing - question - answer** и считать верные ответы, то получится, что считаются ВЕРНЫЕ ответы на вопросы, занесенные в таблицу **question**, а не верные ответы, которые дал пользователь.

In [12]:
%%sql
SELECT
    name_student,
    name_subject,
    date_attempt,
    ROUND(SUM(is_correct / 3 * 100), 2) AS Результат
FROM
    answer
    JOIN testing USING(answer_id)
    JOIN attempt USING(attempt_id)
    JOIN subject USING(subject_id)     
    JOIN student USING(student_id)
GROUP BY
    name_student,
    name_subject,
    date_attempt
ORDER BY
    name_student ASC,
    date_attempt DESC;

 * mysql://root:***@localhost/test
7 rows affected.

[('Баранов Павел', 'Основы SQL', datetime.date(2020, 4, 15), Decimal('33.33')),
 ('Баранов Павел', 'Основы баз данных', datetime.date(2020, 3, 23), Decimal('66.67')),
 ('Семенов Иван', 'Основы SQL', datetime.date(2020, 5, 17), Decimal('33.33')),
 ('Семенов Иван', 'Основы SQL', datetime.date(2020, 4, 15), Decimal('66.67')),
 ('Семенов Иван', 'Основы SQL', datetime.date(2020, 3, 23), Decimal('100.00')),
 ('Яковлева Галина', 'Основы баз данных', datetime.date(2020, 4, 21), Decimal('100.00')),
 ('Яковлева Галина', 'Основы баз данных', datetime.date(2020, 3, 26), Decimal('0.00'))]

## 3.1.10 Задание

Для каждого вопроса вывести процент успешных решений, то есть отношение количества верных ответов к общему количеству ответов, значение округлить до 2-х знаков после запятой. Также вывести название предмета, к которому относится вопрос, и общее количество ответов на этот вопрос. В результат включить название дисциплины, вопросы по ней (столбец назвать **Вопрос**), а также два вычисляемых столбца **Всего_ответов** и **Успешность**. Информацию отсортировать сначала по названию дисциплины, потом по убыванию успешности, а потом по тексту вопроса в алфавитном порядке.

Поскольку тексты вопросов могут быть длинными, обрезать их 30 символов и добавить многоточие "...".  

1. Чтобы выделить крайние левые n символов из строки используется функция LEFT(строка, n):
LEFT("abcde", 3) -> "abc"  
2. Соединение строк осуществляется с помощью функции CONCAT(строка_1, строка_2):
CONCAT("ab","cd") -> "abcd"

In [13]:
%%sql
SELECT
    name_subject,
    CONCAT(LEFT(name_question, 30), '...') AS Вопрос,
    COUNT(is_correct) AS Всего_ответов,
    ROUND(SUM(is_correct) / COUNT(is_correct) * 100, 2) AS Успешность
FROM
    subject
    JOIN question USING(subject_id)
    JOIN testing USING(question_id)
    JOIN answer USING(answer_id)
GROUP BY
    name_subject,
    CONCAT(LEFT(name_question, 30), '...')
ORDER BY
    name_subject ASC,
    Успешность DESC,
    Вопрос ASC;

 * mysql://root:***@localhost/test
9 rows affected.

[('Основы SQL', 'Условие, по которому отбираютс...', 1, Decimal('100.00')),
 ('Основы SQL', 'Запрос на выборку начинается с...', 4, Decimal('75.00')),
 ('Основы SQL', 'Какой запрос выбирает все запи...', 3, Decimal('66.67')),
 ('Основы SQL', 'Для сортировки используется:...', 2, Decimal('50.00')),
 ('Основы SQL', 'Для внутреннего соединения таб...', 2, Decimal('0.00')),
 ('Основы баз данных', 'База данных - это:...', 3, Decimal('66.67')),
 ('Основы баз данных', 'Какой тип данных не допустим в...', 2, Decimal('50.00')),
 ('Основы баз данных', 'Концептуальная модель использу...', 2, Decimal('50.00')),
 ('Основы баз данных', 'Отношение - это:...', 2, Decimal('50.00'))]